/*Copyright (C) 2022 Huzieva Iyliia*/
#include <iostream>
#include <math.h>

/*У всіх завданнях, крім зазначених у завданні операцій, обов'язково
повинні бути реалізовані наступні методи:
• метод ініціалізації Init();
• метод введення із клавіатури Read();
• метод вивідення на екран Display();
• перетворення в рядок toString().
6. Створити клас Angle для роботи з кутами на площині, що задаються
завбільшки градусах і хвилинах. Обов'язково повинні бути реалізовані:
переклад у радіани, приведення до діапазону 0-360, збільшення й зменшення
кута на задану величину, одержання синуса, порівняння кутів.
*/

class Angle {
	
public:
	int degrees; //Значення градусів
	double minutes;  //Значення хвилин
	/*Розділення значень градусів і кутів було зроблено для зручного підрахунку значення кута в радіанах,
									бо значення хвилин рахується окремо. Хвилини треба поділити на 60. */
	Angle Init(int d, float m);
	Angle Read(int d, float m);
	void Display();
	char toString();
private:
	
	float Radian();
	float constrainAngle360();
	float increaseAngle();
	float reductionAngle();
	float Sinus();
	float comparsionAngle();
	
};
